app/views/devise/registrations/new.html.erb

SELECT `roles`.`role_name`, `roles`.`id` FROM `roles`
---
    <%= f.label :roles, as: 'Role Name' %><br/>
    <%= f.select :role_ids, Role.pluck(:role_name, :id),{include_blank: "Select Type",required:true } %>