app/controllers/application_controller.rb

SELECT `roles`.* FROM `roles` INNER JOIN `roles_users` ON `roles`.`id` = `roles_users`.`role_id` WHERE `roles_users`.`user_id` = 39 ORDER BY `roles`.`id` ASC LIMIT 1
---
	def after_sign_in_path_for(resource)

    if current_user.roles.first.role_name == "customer"