app/controllers/bookings_controller.rb

SELECT `bookings`.* FROM `bookings` WHERE `bookings`.`user_id` = 38
SELECT COUNT(*) FROM `bookings` WHERE `bookings`.`user_id` = 44
---
  def my_bookings
    if user_signed_in?
      @mybookings = current_user.bookings
      flash.now[:notice] = "You've made exactly #{@mybookings.size} bookings."

SELECT `roles`.* FROM `roles` INNER JOIN `roles_users` ON `roles`.`id` = `roles_users`.`role_id` WHERE `roles_users`.`user_id` = 44 ORDER BY `roles`.`id` DESC LIMIT 1
---
  def create
    @booking = Booking.new(booking_params)
    # @property  = Property.where(id: params[:booking][:property_id]).first

    if @booking.start_date && @booking.end_date

      if(@booking.start_date >= Date.today && @booking.end_date > @booking.start_date)
        logger.info "this is correct format....."

        if current_user.roles.last.role_name == "customer"

DELETE FROM `bookings` WHERE `bookings`.`id` = 40
---
  def destroy
    @booking.destroy

SELECT `bookings`.* FROM `bookings` WHERE `bookings`.`id` = 50 LIMIT 1
---
    def set_booking
      if !user_signed_in?
        redirect_to "/"
      end
      @booking = Booking.find(params[:id])