app/controllers/bookings_controller.rb

SELECT `bookings`.* FROM `bookings`
---
  def index
     if user_signed_in?
      @bookings = Booking.all

INSERT INTO `bookings` (`price`, `start_date`, `end_date`, `status`, `created_at`, `updated_at`, `user_id`, `property_id`) VALUES (NULL, '2022-08-17', '2022-08-27', NULL, '2022-08-29 09:24:28.650510', '2022-08-29 09:24:28.650510', 38, 8)
---
  def create
    @booking = Booking.new(booking_params)

    if @booking.start_date && @booking.end_date

      if(@booking.start_date >= Date.today && @booking.end_date > @booking.start_date)
        flash.now[:alert] = "correct format"
        logger.info "this is correct format....."

        @booking.user_id=current_user.id

        respond_to do |format|
          if @booking.save

DELETE FROM `bookings` WHERE `bookings`.`id` = 24
---
  def destroy
    @booking.destroy

SELECT `bookings`.* FROM `bookings` WHERE `bookings`.`id` = 25 LIMIT 1
---
    def set_booking
      if !user_signed_in?
        redirect_to "/"
      end
      @booking = Booking.find(params[:id])