app/controllers/bookings_controller.rb

  def create
    @booking = Booking.new(booking_params)
    # @property.user_id=current_user.id
    @booking.user_id=current_user.id
    # @booking.popperty_id=current_user.property.id


    respond_to do |format|
      if @booking.save
---
INSERT INTO `bookings` (`price`, `start_date`, `end_date`, `status`, `created_at`, `updated_at`, `user_id`, `property_id`) VALUES (78, NULL, NULL, NULL, '2022-08-25 11:10:57.270183', '2022-08-25 11:10:57.270183', 37, 1)

    def set_booking
      if !user_signed_in?
        redirect_to "/"
      end
      @booking = Booking.find(params[:id])
---
SELECT `bookings`.* FROM `bookings` WHERE `bookings`.`id` = 5 LIMIT 1