app/controllers/properties_controller.rb

  def index
    if user_signed_in?
      @properties = current_user.properties.all
---
SELECT `properties`.* FROM `properties` WHERE `properties`.`user_id` = 17

  def allprop
    @property = Property.where(inactive:false)
---
SELECT `properties`.* FROM `properties` WHERE `properties`.`inactive` = FALSE LIMIT 1

  def create
    @property = Property.new(property_params)
    @property.user_id=current_user.id
    respond_to do |format|
      if @property.save
---
INSERT INTO `properties` (`property_name`, `address`, `price`, `pin`, `user_id`, `created_at`, `updated_at`, `inactive`) VALUES ('ash property 4', 'pratap nagar,new delhi', 998, 565678, 45, '2022-09-05 09:56:42.964026', '2022-09-05 09:56:42.964026', FALSE)

  def update
    respond_to do |format|
      if @property.update(property_params)
---
UPDATE `properties` SET `properties`.`updated_at` = '2022-09-05 09:58:28.908911', `properties`.`inactive` = FALSE WHERE `properties`.`id` = 11

  def destroy
    @property.destroy
---
DELETE FROM `properties` WHERE `properties`.`id` = 17

    def set_property
      @property = Property.find(params[:id])
---
SELECT `properties`.* FROM `properties` WHERE `properties`.`id` = 11 LIMIT 1