app/controllers/properties_controller.rb

  def allprop
    @property = Property.all
---
SELECT `properties`.* FROM `properties`